Revit 2024 API
IControllableDropHandler Interface
 An interface to be executed when custom data is dragged and dropped onto the Revit user interface. This interface is different from IDropHandler in that it allows the handler to verify whether the drop event can be executed on the given view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public interface IControllableDropHandler : IDropHandler
Visual Basic
Public Interface IControllableDropHandler _
	Inherits IDropHandler
Visual C++
public interface class IControllableDropHandler : IDropHandler
Remarks
 Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.
See Also
IControllableDropHandler Members
Autodesk.Revit.UI Namespace